---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SlantedColumnBaseExtension
source: html/e6774e6c-1427-4fce-2100-335c962215af.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SlantedColumnBaseExtension Property

"Base Extension"

## Syntax (C#)
```csharp
public static ForgeTypeId SlantedColumnBaseExtension { get; }
```